{
	"START": {
		"name": "Your bedroom upstairs",
		"desc": "You close your eyes after a stressful day of school and end up falling asleep. You realize you're subconsciously wondering around your home in a dream and you feel like there's someone present in the house that's not welcomed there with you. You decide you're going to escape this dream as fast as possible because it's giving you the serious case of heebie-jeebies.",
		"exits": [{
				"exit": "NORTH",
				"target": "BATHROOM"
		}, {
				"exit": "SOUTH",
				"target": "CLOSET"
		}],
		"items": []
	},

	"BATHROOM": {
		"name": "Bathroom",
		"desc": "You head down to the other side of the hall into the bathroom to find anything that can be used as a weapon.",
		"exits": [
			{
				"exit": "SOUTH",
				"target": "CLOSET"
			}],
		"items": [{
			"item": "HAIR TRIMMING SCISSORS",
			"desc": "You open the cabinet located under the bathroom sink and find a pair of hair trimming scissors. I suggest you take them and use them as a weapon!",
			"take": "You take the hair trimming scissors."
		}]
	},

	"CLOSET": {
		"name": "The upstairs closet",
		"desc": "Well... shit. You stab yourself in the hand trying to put the scissors away in your tiny jean pocket. You go to the closet to find a band-aid.",
		"exits": [
			{
				"exit": "WEST",
				"target": "BROTHERSROOM"
			}, {
				"exit": "SOUTH",
				"target": "STAIRS"
			}, {
				"exit": "WEST",
				"target": "PARENTSROOM"
			}, {
				"exit": "EAST",
				"target": "LAUNDRYROOM"
		}],
		"items": [{
			"item": "BAND-AID",
			"desc": "You open the skinny closet door and rummage through a basket full of medical supplies. You find the band-aid you were looking for.",
			"take": "You take the band-aid and put it over your stupid stab wound."
		}]
	},

	"BROTHERSROOM": {
		"name": "On the other side of your bedroom",
		"desc": "As you look around the dark room for any potential danger, you hear a loud bang coming from the other side of your brothers wall. You begin to understand that the noise is coming from your room! You quickly decide to go to a different floor of the house in hopes of avoiding this scary stranger!",
		"exits": [
			{
				"exit": "DOWN",
				"target": "STAIRS"
		}],
		"items": []
	},
	
	"STAIRS": {
		"name": "Squeeky staircase",
		"desc": "Of course, the decision to go downstairs is about to backfire! This unwelcomed guest is going to figure out your exact location by hearing the creeks of the stairs. What do you do?",
		"exits": [
			{
				"exit": "TIPTOE",
				"target": "KITCHEN"
			}, {
				"exit": "RUN",
				"target": "START" 
		}],
		"items": []
	},

	"KITCHEN": {
		"name": "Kitchen",
		"desc": "You arrive in the kitchen and notice things have been moved around. It looks as if someone was looking for something. Luckily, you're not staying long enough to find out what it is!",
		"exits": [
			{
				"exit": "EAST",
				"target": "LAUNDRYROOM"
			}, {
				"exit": "WEST",
				"target": "PARENTSROOM"
		}],
		"items": []
	},

	"LAUNDRYROOM": {
		"name": "Your least favorite part of the house. Laundry is almost compareable to death.",
		"desc": "You search for something that can be used to help you escape from this nightmare but being in this room is only going to waste your time.",
		"exits": [
			{
				"exit": "WEST",
				"target": "PARENTSROOM"
			}, {
				"exit": "SOUTH",
				"target": "KITCHEN"
		}],
		"items": []
	},

	"PARENTSROOM": {
		"name": "The biggest room in the house.",
		"desc": "You know there's a landline located in here. Why? Because moms and dads are boomers.",
		"exits": [
			{
				"exit": "AWAKE",
				"target": "AWAKE"
		}],
		"items": [{
			"item": "PHONE",
			"desc": "You pick up the phone, and so far, it looks like it works! Do you risk dailing the phone?",
			"take": "You dial the phone in hopes of returning to reality."
		}]
	},

	"AWAKE": {
		"name": "Back to reality",
		"desc": "You finally wake up from your so called terrible dream. Maybe you'll think twice next time before procrastinating your homework, mwhaha.",
		"exits": [
			{
				"exit": "",
				"target": "END"
			}],
			"items": []
	}
}